Revit 2024 API
Generic.GenericRefractionIndex Property
 The property labeled "Refraction" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericRefractionIndex { get; }
Visual Basic
Public Shared ReadOnly Property GenericRefractionIndex As String
	Get
Visual C++
public:
static property String^ GenericRefractionIndex {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0.01, 5".
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace